USE DBClassroom;
GO


-- Примерни потребители
INSERT INTO [User] (FullName, Email, [Password], FacNum, PhoneNum)
VALUES 
('Иван Иванов', 'ivan@uni.bg', 'pass123', 'F12345', '0888123456'),
('Мария Георгиева', 'maria@uni.bg', 'pass123', 'F67890', '0888456789'),
('Петър Петров', 'peter@uni.bg', 'pass123', 'F11223', '0888777666'),
('Мариян Василев', 'marian@uni.bg', 'pass123m', 'F67899', '0888459889'),
('Петя Атанасова', 'petq@uni.bg', 'pass123', 'F11223', '0888779636');
GO

-- Класни стаи
INSERT INTO Classroom (CourseName, [Type], Capacity)
VALUES 
('Приложна математика', 'Лекция/час', 25),
('История', 'Упражнение', 30),
('Български с история', 'Лекция/час', 25),
('Микробиология', 'Упражнение', 30),
('Английски език', 'Лекция', 20);
GO

-- Курсове
INSERT INTO Course (CourseName, CountOfParticipants, Classroom_Id)
VALUES 
('Приложна математика упр', 2, 1),
('История лекция', 1, 2),
('Микробиология упр', 2, 3),
('Микробиология лекция', 1, 4),
('Английски език', 3, 5);
GO

-- Връзка потребител-курс
INSERT INTO UserCourse (Role, Course_Id, User_Id)
VALUES 
('Преподавател', 1, 1),
('Студент', 1, 2),
('Студент', 2, 3),
('Преподавател', 3, 4),
('Студент', 3, 5);
GO

-- Инфо канал
INSERT INTO InfoChannel ([Message], Comment, Course_Id)
VALUES 
('Добре дошли в курса!', 'Начало на семестъра', 1),
('Изпитът е на 20.11', 'Подгответе се добре', 2),
('Напомняне за домашно', 'Срокът изтича утре', 3),
('Няма час в петък', 'Занятието се отлага', 4),
('Ново домашно упражнение', 'Вижте в системата', 5);
GO

-- Задания
INSERT INTO Assignment (Topic, [Desc], StartDate, FinalDate, [Status], Grade, Course_Id)
VALUES 
('Домашно 1', 'Алгебра', '2025-10-01', '2025-10-15', 'assigned', NULL, 1),
('Есе по история', 'Ренесансът', '2025-09-20', '2025-10-10', 'completed', '6.00', 2),
('Домашно по микробиология', 'Клетъчни структури', '2025-09-10', '2025-09-25', 'assigned', NULL, 3),
('Проект по английски', 'Презентация за UK култура', '2025-09-30', '2025-10-20', 'completed', '5.50', 5),
('Тест по математика', 'Функции и уравнения', '2025-11-01', '2025-11-05', 'assigned', NULL, 1);
GO

-- Срещи
INSERT INTO Meeting (StartTime, EndTime, Participating, Course_Id)
VALUES 
('2025-11-15 10:00', '2025-11-15 11:00', 'всички', 1),
('2025-11-20 12:00', '2025-11-20 13:30', 'група А', 2),
('2025-11-25 09:00', '2025-11-25 10:30', 'всички', 3),
('2025-11-28 14:00', '2025-11-28 15:00', 'преподавател + група Б', 4),
('2025-12-01 08:00', '2025-12-01 09:00', 'всички', 5);
GO

-- Оценки
INSERT INTO Grade (Graded, Ungraded, Comment, Assignment_Id, UserCourse_Id)
VALUES 
('5.50', NULL, 'Много добре', 1, 2),
('6.00', NULL, 'Отлично есе', 2, 3),
('5.00', NULL, 'Добро представяне', 3, 5),
('4.50', NULL, 'Средно ниво', 4, 2),
('6.00', NULL, 'Перфектен тест', 5, 3);
GO
